
public class Questions {
	String[][] answers={
	        {" Κίρκη "," Καλυψώ ", " Αφροδίτη " },  
	        {" Άρης "," Ήφαιστος ", " Ποσειδώνας " },
	        { "'Ηλιος",  "Ποσειδώνας"," Δίας" }, 
	        {" Δημόδοκος", "Αντίνοος"," Φήμιος "}, 
	        {" τον Κένταυρο","τον Κέρβερο", " τον Ερύμανθο "},
	        {" Αγαμέμνων", "Δαίδαλος","  Αιγέας "},
	        {" Φιλοκτήτης", "Τεύκρος","Πρωτεσίλαος" } ,
	        {"Ιοκάστη ","Ισμήνη ",  "Ελένη "}, 
	        {"Βρισηίδα " ," Χρυσηίδα" , "Ανδρομάχη" }, 
	        {"Προμηθέας ", "Επιμηθάες" ," ΄Ατλας" } , 
	        { "Στην Κνωσσό" , "Στην Τροία", "Στον Εύρωμο" },
	        {" Σε εννέα" ,"Σε πέντε" , "Σε δύο" }, 
	        {"1500-1490 π.Χ " ,"1250-1240 π.Χ ", "1100-1090 π.Χ" }, 
	        {"Στον Ευριτίωνα και τον Όρθρο" ,"Στον Μενοίτιο και τον Άδη" }, 
	        {" Η θεά Ήρα" ,"Η θεά Δήμητρα" , "Η θεά Αφροδίτη" }, 
	        {" Για να φέρουν εις πέρας τρεις άθλους ","Για να πάρουν το χρυσόμαλλο δέρας" , "Ήταν διαταγή του Πελία" },
	        {"Είχε κεφάλι φιδιού, ουρά σκύλου και σώμα κατσίκας " , "Είχε κεφάλι ταύρου, ουρά λιονταριού και σώμα κατσίκας"," Είχε κεφάλι λιονταριού, ουρά φιδιού και σώμα κατσίκας" },
	        {"Στο Ιδαιό Άντρο " ,"Στη Φαιστό " , "Στην Τροία " },
	        {" Τα φίδια" ,"Η τρίαινα" ,"Τα σπαθιά "}, 
	        {"Ο Θησέας", "Ο Ιάσονας","Ο Οδυσσέας"  }
		
		//NEW
		
		/*1*/ {"Όλυμπος", "Ερύμανθος", "Πίνδος"}, //swsth apantisi 1
		/*2*/ { "Ιφικλής" , "Αππελής" , "Ετεοκλής"}, //swsti apantisi 0
		/*3*/ { "Οι Στυμφαλίδες όρνιθες", "Η Λερναία Ύδρα", "Το λιοντάρι της Νεμέας"}, //2
		/*4*/ { "Αριάδνη", "Ανδρομάχη", "Ανδριανή"}, //1
		/*5*/ { "Δίας", "Απόλλωνας", "Ήρα"}, //2
		/*6*/ { "Θησέας", "Ιάσων", "Ίκαρος"}, //2
		/*7*/ { "με ρόπαλο", "με βέλη", "με σπαθί"}, //0
		/*8*/ { "Της Αυλίδας","Του Ναυπλίου" , "Του Βόλου"}, //0
		/*9*/ { "η Ιωλκός", "Αργώ", "Γοργώ"}, //1
		/*10*/ { "Ιδομενέας", "Αίαντας","Νέστορας"}, //2
		
		/*11*/ { "Αππόλων", "Πλούτωνας", "Ερμής"}, //2
		/*12*/ { "Θησέας", "Ορφέας", "Ιάσονας"}, //1
		/*13*/ {"Λητώ", "Δανάη", "Αντιόπη"}, //0
		/*14*/ {"Ηρακλής", "Οδυσσέας", "Οιδίποδας"}, //2
		/*15*/ {"Άρτεμις", "Λητώ", "Ήρα"}, //0
		/*16*/ {"λιοντάρια","αγελάδες", "γουρούνια"}, //2
		/*17*/ {"Δίας", "Απόλλων", "Ερμής"}, //1
		/*18*/ {"Φρίξος", "Ναύπλιος", "Άργος"}, //2
		/*19*/ {"Αίγισθο", "Έκτορα", "Πάρη"}, //0
		/*20*/ {"Ουρανός", "Άτλαντας", "Κρόνος"}, //2
		
		/*21*/ {"Κύκλωπες", "Γίγαντες", "Τιτάνες"}, //0
		/*22*/ {"1", "7", "3"}, //1
		/*23*/ {"Ταύρος", "Βοσκός", "Σύννεφο"},	//0
		/*24*/ {"Ποσειδώνας", "Διόνυσος", "Δίας"}, //0
		/*25*/ {"Η Σκύλλα", "Η Χίμαιρα", "Η Χάρυβδη"}, //1
		/*26*/ {"Δίας", "Ωκεανός", "Ουρανός"}, //2
		/*27*/ {"Αθηνά", "Ήρα", "Αφροδίτη"},  //2
		/*28*/ {"Περσέας", "Ηρακλής", "Θησέας"}, //0
		/*29*/ {"Άφησε ένα περιστέρι να περάσει πρώτα", "Αποφάσισε να περάσει γύρω από αυτές", "Το πλοίο του καταστράφηκε και μόνο αυτός επιβίωσε"},//0
		/*30*/ {"Εστία", "Εκάτη", "Μηδεία"}, //1
		/*31*/ {"Δίας", "Άρης", "Ήφαιστος"}, //2
		/*32*/ {"10", "20", "30"}, //0
		/*33*/ {"Μεγάλωσε δίπλα στους θεούς.","Η μητέρα του τον βούτηξε στα νερά του ποταμού της Στύγας.", "Έφαγε αμβροσία την τροφή των θεών."}, //1 
		/*34*/ {"Δίδυμοι", "Μικρή και μεγάλη άρκτος", "Μικρός και μεγάλος κύνας"}, //0
		/*35*/ {"Χάριτες", "Μούσες", "Νύμφες"}, //1
		/*36*/ {"Σίνη", "Σκίρωνα", "Προσκρούστη"}, //1
		/*37*/ {"Σε γυναίκα", "Σε φίδι", "Σε άλογο"}, //0
		/*38*/ {"Σφίγγα", "Μέδουσα", "Λερναία Ύδρα"}, //1
		/*39*/ {"κεφάλι φιδιού", "σώμα λιονταριού", "φτερά πουλιών"}, //2
		
		/*40*/ {"2", "3", "1"}, //0
		/*41*/ {"Άρης", "Δίας", "Διόνυσος"}, //1
		/*42*/ {"Περσεφόνη", "Πύρρα", "Πανδώρα"}, //2
		/*43*/ {"Έρωτας", "Χάος", "Ουρανός"}, //1
		/*44*/ {"Θησέας", "Αχιλλέας", "Οδυσσέας"}, //0
		/*45*/ {"Αθηνά", "Άρτεμις", "Αφροδίτη"}, //1
		/*46*/ {"Ερμής", "Ποσειδώνας", "Άρης"}, //2
		/*47*/ {"Πλούτωνας", "Ποσειδώνας", "Άρης"}, //0
		/*48*/ {"Ύδρα", "Έχιδνα", "Σκύλα"}, //1
		/*49*/ {"0", "2", "3"} //2
	        
	             };
	 int[] ca = { 1, 1, 0, 2, 1, 2, 2, 1, 0, 2, 0, 0, 1, 0, 0, 1, 2, 0, 1, 2, /*new*/ 1, 0, 2, 1, 2, 2, 0, 0, 1, 2, 2, 1, 0, 2, 0, 2, 1, 2, 0, 2, 0, 1, 0, 0, 1, 2, 2, 0, 0, 1, 2, 0, 1, 0, 1, 1, 2, 0, 1, 2, 1, 0, 1, 2, 0, 1, 2
			  };
	
	  String[] qs = { "Στο νησί ποιας θεάς φιλοξενήθηκε ο Οδυσσέας για επτά χρόνια καθώς προσπαθούσε να επιστρέψει στην Ιθάκη;" ,
			  "Ποιος θεός φιλοτέχνησε την ασπίδα του Αχιλλέα; ", 
			  "Ποιος θεός οργίστηκε με τον Οδυσσέα και τους συντρόφους του, επειδή του έφαγαν τα ιερά του βόδια;",
			  "Πώς λεγόταν ο αοιδός του παλατιού του Οδυσσέα στην Ιθάκη;",
			  "Ποιο σκυλί ζήτησε ο Ευρυσθέας από τον Ηρακλή να του φέρει από τον Κάτω Κόσμο;",
			  "Πώς λεγόταν ο πατέρας  του Θησέα;","Πώς λεγόταν ο πρώτος Αχαιός πολεμιστής που σκοτώθηκε στην Τροία;",
			  "Ποια ήταν η αδερφή της Αντιγόνης;", "Πώς λεγόταν η σκλάβα του Αχιλλέα την οποία απαίτησε ο Αγαμέμνων να του την πάρει;",
			  "Ποιος ήταν ο Τιτάνας που τιμωρήθηκε από το Δία να φέρει αιώνια στους ώμους του τον ουράνιο θόλο;",
			  "Που ήταν κτισμένο το παλάτι του βασιλιά Μίνωα;","Σε πόσους συνολικά άθλους διακρίθηκε ο Θησέας;",
			  "Σύμφωνα με τον Ηρόδοτο, πότε έγινε ο Τρωικός Πόλεμος;",
			  "Σε ποιους είχε αναθέσει τη φύλαξη των ζώων του ο Γηρυόνης, ο άνθρωπος με τα τρία σώματα;",
			  "Ποια ήταν η βασίλισσα των θεών και των ανθρώπων;","Για ποιον λόγο οργανώθηκε από τον Ιάσονα η Αργοναυτική εκστρατεία",
			  "Πώς έμοιαζε στην όψη μία Χίμαιρα;","Σε ποιο μέρος έκρυψε η Ρέα, τον γιό της Δία προκειμένου να γλιτώσει από τον Κρόνο που έτρωγε τα παιδιά του;",
			  "Ποιο είναι το σύμβολο του θεού Ποσειδώνα ;", "Ποιος ήρθε «αντιμέτωπος» με τις Σειρήνες;"
				  
				  //NEW
			 /*1*/ "Σε ποιό βουνό έστειλε ο Ευρυσθέας  τον Ηρακλή για να βρει το αγριογούρουνο;",
			 /*2*/ "Πως λεγόταν ο αδερφός του Ηρακλή;",
			 /*3*/ "Ποιός ήταν ο πρώτος άθλος του Ήρακλη;",
			 /*4*/ "Πως λεγόταν η γυναίκα του Έκτορα;",
			 /*5*/ "Ποιος θεός ήταν με το μέρος των Αχαιών στον πόλεμο της Τροίας;",
			 /*6*/ "Πως λεγόταν ο γιός του Δαιδάλου;",
			 /*7*/ "Πως σκότωσε ο Ηρακλής το λιοντάρι της Νεμέας;",
			 /*8*/ "Από ποιο λιμάνι ξεκίνησαν οι Αχαιοί για την Τροία;",
			 /*9*/ "Πως λεγόταν το πλοίο με το οποίο ο Ιάσονας έφτασε στην Κολχίδα;",
			 /*10*/ "Πως λεγόταν ο σοφός βασιλίας της Πύλου που πήρε μέρος στον Τρωικό πόλεμο;",
			 
			 /*11*/ "Ποιος θεός είχε το προσωνύμιο ψυχοπομπός;",
			 /*12*/ "Ποιος κατέβηκε στον Άδη για να πάρει πίσω τη γυναίκα του, την Ευριδίκη;",
			 /*13*/ "Ο Δίας μεταμορφώθηκε σε κύκνο για να ενωθεί ερωτικά με την:",
			 /*14*/ "Ποιός έλυσε το γρίφο της Σφίγγας;",
			 /*15*/ "Η αδερφή του Απόλλωνα ήταν η:",
			 /*16*/ "Η Κίρκη μεταμόρφωσε τους συντρόφους του Οδυσσέα σε:",
			 /*17*/ "Ο θεός της μαντικής τέχνης ήταν ο:",
			 /*18*/ "Το πιστό σκυλί του Οδυσσέα λεγόταν:",
			 /*19*/ "Ο Αγαμέμνονας φονεύτηκε από τον:",
			 /*20*/ "Ο πατέρας του Δία ήταν ο:",
			 /*21*/ "Ποιοι έδωσαν τον κεραυνό στον Δία;",
			/*22*/ "Πόσα χρόνια έμεινε ο Οδυσσέας στο νησί της Καλυψούς σύμφωνα με τον Όμηρο;",
			/*23*/ "Σε τι μεταμορφώθηκε ο Δίας για να συνευρεθεί με την Ευρώπη;",
			/*24*/ "Ποιος θεός έχει ως ιερό ζώο τα άλογα;",
			/*25*/ "Ποιο μυθικό τέρας είχε σώμα κατσίκας και κεφάλι λιονταριού;",
			/*26*/ "Ποια θεότητα συνδέεται με δεσμούς αίματος με την Αφροδίτη;",
			/*27*/ "Σε ποια θεά έδωσε ο Πάρης το μήλο της Έριδος;",
			/*28*/ "Ποιος κατάφερε να θανατώσει τη Μέδουσα;",
			/*29*/ "Πως πέρασε ο Ιάσωνας από τις συμπληγάδες πέτρες;",
			/*30*/ "Ποια ήταν η θεά της μαγείας;",
			/*31*/ "Ποιος θεός του Ολύμπου αλυσόδεσε τον Προμηθέα στον Καύκασο;",
			/*32*/ "Πόσα χρόνια περιπλανήθηκε ο Οδυσσέας πριν φτάσει στην Ιθάκη;",
			/*33*/ "Πως έγινε ο Αχιλλέας άτρωτος;",
			/*34*/ "Ποιος αστερισμός αντιπροσωπεύει τους διόσκουροους;",
			/*35*/ "Η Τερψιχόρη ήταν μια από τις:",
			/*36*/ "Ποιο ληστή αντιμετώπισε ο Θησέας στην Κακιά Σκάλα;",
			/*37*/ "Σε τι μεταμορφώθηκε για 7 χρόνια ο μάντης Τειρεσίας;",
			/*38*/ "Ο Πήγασος γεννήθηκε όταν ποιο μυθικό τέρας έχασε το κεφάλι του;",
			/*39*/ "Οι Άρπυιες  είχαν:",
			
			/*40*/ "Πόσες αδερφές είχε η Μέδουσα;",
			/*41*/ "Ποιός θεός της αρχαιότητας ήταν <<γυναικάς>>;",
			/*42*/ "Ποιά χαρακτηρίζεται ως η γιαγιά της ανθρωπότητας;",
			/*43*/ "Ποιός ήταν ο πατέρας της Γαίας;",
			/*44*/ "Ποιός ήρωας πήρε μαζί του την πριγκίπισσα Αριάδνη φεύγοντας από την Κρήτη και την εγκατέλειψε στην Νάξο;",
			/*45*/ "Ποιά θέα δολοφόνησε 6 από τις κόρες την Νιόβης επειδή προσέλαβαν την μητέρα της;",
			/*46*/ "Ποιός θεός υπάκουε πίστα στις εντολές της Αθήνας;",
			/*47*/ "Ποιος θεός κυβερνούσε τον κάτω κόσμο;",
			/*48*/ "Ποιά ήταν η μητέρα των τεράτων;",
			/*49*/ "Πόσα παιδιά είχε η Αφροδίτη;"
			   };
	  
	    public void startQuestions(int n){
	      Question_check questions = new Question_check(qs[n],answers[n],ca[n],this);
	      questions.playq();  
	        
	       
	    
	    }
}
